test/drill/mutations/reconnect-linger-disabled.patch
# drill: relay_killed_mid_group_aborts_then_resumes
# expect: after the restart: the track aborted
#
# Removes the linger a reconnecting session gives its broadcasts. Without it a
# session drop tears the broadcast down immediately instead of holding it for the
# reconnect to splice onto, so a relay restart stops being a bounded gap and
# becomes a teardown the subscriber has to notice and recover from itself.
diff --git a/rs/moq-native/src/reconnect.rs b/rs/moq-native/src/reconnect.rs
index 496f48a14..35501d12f 100644
--- a/rs/moq-native/src/reconnect.rs
+++ b/rs/moq-native/src/reconnect.rs
@@ -104,10 +104,8 @@ impl Backoff {
 	/// before the broadcasts tear down. A zero timeout retries forever, so the
 	/// broadcasts linger forever too.
 	pub fn linger(&self) -> Duration {
-		match self.timeout.is_zero() {
-			true => Duration::MAX,
-			false => self.timeout.saturating_add(Duration::from_secs(1)),
-		}
+		// MUTATION: no linger, so a session drop closes the broadcasts it fed.
+		Duration::ZERO
 	}
 }
 
