test/drill/mutations/reconnect-stops-after-session-loss.patch
# drill: relay_killed_mid_group_aborts_then_resumes::loopback
# expect: subscriber: reconnect loop gave up
#
# Removes redialing after an established session is lost. The reconnect loop
# treats a healthy session's end the way one-shot mode does and stops, so a
# relay restart becomes a permanent outage instead of a bounded gap the same
# handles resume across.
diff --git a/rs/moq-tokio/src/connection.rs b/rs/moq-tokio/src/connection.rs
index 13f3fb4e2..349827099 100644
--- a/rs/moq-tokio/src/connection.rs
+++ b/rs/moq-tokio/src/connection.rs
@@ -845,7 +845,8 @@ impl Connection {
 					// One-shot mode: the session ending ends the connection. Its close
 					// reason is the terminal error, mirroring `moq_net::Session::closed`.
 					// A GOAWAY already returned above.
-					if !client.reconnect {
+					// MUTATION: losing an established session ends the loop instead of redialing.
+					if !client.reconnect || healthy {
 						return match ended {
 							Ended::Closed(res) => res.map_err(Error::from),
 							Ended::Goaway(_) => unreachable!("handled before the migration branch"),
